<a href="https://colab.research.google.com/github/ShravantiHable/AA/blob/main/ADV_C194_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Additional-Activty-4
#Plot the bubble plot for top 5 country who has produce maximum number of movies
#predefine code
import pandas as pd
import matplotlib.pyplot as plt
df = pd.read_csv('https://shravantihable.github.io/AA/movie_update.csv')
df

group_by_country = df.groupby('Country')['Title'].count().reset_index()
group_by_country

sorted_df = group_by_country.sort_values(by=['Title'], ascending = False)
sorted_df
#predefine code end

#Press shift + enter to run the cell and check what columns are there in dataframe

#from the dataframe sorted_df retrive first 5 rows using the head() function and store it in variable top_5

#print the variable top_5


#using plt.figure() set thw figsize of the plot as (20, 8)


#using the plt.scatter() plot the scatter function with following parameters
#top_5['Country']-to retrive the 'Country' column values present in variable top_5
#top_5['Title']- to retrive the 'Country' column values present in variable top_5
#color
#label as 'Number of movies'
#alpha = 0.5 - to make the bubble slightly solid in color.
#s= top['Title'] - 's' stands for size of the bubble, it starts increasing as per the number of movies in 'Title' column. 



# using the plt.xticks() function add the rotation parameter as 'vertical'

#plot the legend using the plt.legend() function

# using the plt.xlabel() function set the label as "Country", with size as 14

# using the plt.ylabel() function set the label as "Number of movies", with size as 14

                                                Country  Title
1059                                      United States   8776
477                                               India   1064
908                                      United Kingdom    905
117                                              Canada    555
34                                            Australia    202
...                                                 ...    ...
507                                   Ireland,Australia      1
508    Ireland,Belgium,France,Luxembourg,United Kingdom      1
509                       Ireland,Belgium,United States      1
511   Ireland,Canada,Luxembourg,United States,United...      1
1302                                      Zambia,Sweden      1

[1303 rows x 2 columns]